In [9]:
import pandas as pd 

data = pd.Series([1,2,3,4]) # array 
print(data)

0    1
1    2
2    3
3    4
dtype: int64

In [8]:
print(type(data.values)) # to numpy array 
arr = data.values
arr

<class 'numpy.ndarray'>

array([1, 2, 3, 4])

In [11]:
# indexing 
print(data[0])

1

In [17]:
# custom indexing 

data1 = pd.Series(["appel","banan","tomate","anans","Nothins"] , index = ["number 1","number 2" ,"number 3" ,"number 4" ,"number 5"] ) # index
data1

number 1      appel
number 2      banan
number 3     tomate
number 4      anans
number 5    Nothins
dtype: object

In [ ]:
print(data1['number 1'])
print(data1[0])
print(data1.iloc[0]) # index numirc fun iloc

appel
appel
appel

C:\Users\a-ara\AppData\Local\Temp\ipykernel_4380\1000344601.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(data1[0])

In [28]:
# A Series from python dictinory 

X = {'california':213123 ,
     'texas':43532543,
     'New York': 112655452,
     'florida': 798966,
    'illionis' : 6636644,}
df =pd.Series(X)  # key dict = index  , paramiter value dict 
df

california       213123
texas          43532543
New York      112655452
florida          798966
illionis        6636644
dtype: int64

In [39]:
print(df['texas':'florida']) # sliceing indexing  from texas to florida 
print('--------------------------')
print(df[1:4]) #

texas        43532543
New York    112655452
florida        798966
dtype: int64
--------------------------
texas        43532543
New York    112655452
florida        798966
dtype: int64

In [54]:
#DataFrame from pandas Series 

name_age = {'abdulla':22,'amar' :32 ,'mazen':19}
name_toll=  {'abdulla':180,'amar' :170 ,'mazen':182}
age = pd.Series(name_age)
print('age pd.Series\n',age)
print('-'*50)

toll = pd.Series(name_toll)
print('toll pd.Series\n',toll)
print('-'*50)
data_frame = pd.DataFrame({'age':age,'toll':toll})
data_frame

age pd.Series
 abdulla    22
amar       32
mazen      19
dtype: int64
--------------------------------------------------
toll pd.Series
 abdulla    180
amar       170
mazen      182
dtype: int64
--------------------------------------------------

         age  toll
abdulla   22   180
amar      32   170
mazen     19   182

In [ ]:
# DataFrame
populatoin = {'california':213123 ,
     'texas':43532543,
     'New York': 112655452,
     'florida': 798966,
    'illionis' : 6636644,}
area ={'california':230 ,
     'texas':240,
     'New York': 250,
     'florida': 260,
    'illionis' : 260,}
data_fram = pd.DataFrame({'populatoin':populatoin,'area':area})
data_fram

            populatoin  area
california      213123   230
texas         43532543   240
New York     112655452   250
florida         798966   260
illionis       6636644   260

In [80]:
#DataFrame 
data1 =pd.DataFrame({'age':[22,32,24],'tol':[180,170,181]},index =['abdullah','mazen','feras'])

In [81]:
data1

          age  tol
abdullah   22  180
mazen      32  170
feras      24  181

In [82]:
data1.index # call index

Index(['abdullah', 'mazen', 'feras'], dtype='object')

In [83]:
data1.columns # call columns

Index(['age', 'tol'], dtype='object')

In [86]:
data1['tol']['abdullah']

np.int64(180)

In [91]:
#from singel series object 
print(pd.DataFrame(age,columns =['age']))
print('-'*40)
# or 
f=pd.DataFrame({'age':age})
print(f.head())

         age
abdulla   22
amar      32
mazen     19
----------------------------------------
         age
abdulla   22
amar      32
mazen     19

In [95]:
# from a list of dictoinaries 

data_list = [{'a':0,'b':0},{'a':1,'b':2},{'a':2,'b':4}]

pd.DataFrame(data_list,index = ['one','tow','theerd'])

        a  b
one     0  0
tow     1  2
theerd  2  4

In [100]:
# rando array
import numpy as np 

data_array = np.random.randint(1,20,30).reshape(10,3) 
pd.DataFrame(data_array,columns = ['first array' ,'second array' ,' theerd array '])

   first array  second array   theerd array
0           11            16              13
1           10            10              12
2            8             1              17
3            3             1              10
4            4            16               2
5           14             4              14
6            9            13              14
7           14            14              18
8           11            18              11
9           11            10              18